from config import spec_simbol

user = {
    'hello': 'Привет, я супер пупер телеграм бот, которому можно задавать вопросики всякие там, попробуй ввести "Как дела?" и увидишь всю мою силу',
    'no_answer': 'Я затрудняюсь ответить, \nОтветь на свой вопрос сам, и я стану умнее!',
    'no_answer': 'Я затрудняюсь ответить, \nОтветь на свой вопрос сам, и я стану умнее!',
}

btn_text = {
    'button1': 'Ерунду сказал',
    'button2': 'Всё окей',
    'button3': 'Добавить ответ',
    'adm_btn1': f'{spec_simbol} Занести вопрос FAQ {spec_simbol}',
    'adm_btn2': f'{spec_simbol} ️Модерация ответов {spec_simbol}️',
    'adm_btn3': f'{spec_simbol} ️Удаление вопросов FAQ {spec_simbol}',
    'adm_btn4': 'Добавить в базу',
    'adm_btn5': 'Удалить',
    'adm_btn6': 'Отмена',
}

adm = {
    'panel': 'Вы вошли в панель администратора',
    'bad_valid': 'Даже не пытайся ...',
    'moder': 'В режиме модерации вы можете просматривать вопросы и ответы пользователей, и добавлять их в основную базу бота.',
    'moder2': 'Приступим, вам будут присылаться сообщения формата вопрос-ответ, для добавления или удаления из базы вы можете нажать соотвествующую кнопку. Для выхода из режима модерации введите /finish',
    'moder3': 'Вопросы для модерации закончились, попробуйте заглянуть сюда позже',

    'moder4': 'В режиме удаления вопросов FAQ вы можете просмотреть все вопросы и удалить ненужные \nДля удаления введите id любого вопроса из следующей таблицы',

}
